// --- ПРАКТИКА --- //

// -- Змінні -- //

// Завдання 1 - Робота зі змінними //

// Оголосіть дві змінні: admin та name.
// Присвойте значення "Іван" змінній name.
// Скопіюйте значення зі змінної name в admin.
// Виведіть значення змінної admin, використовуючи функцію alert (яка повинна показати “Іван”).

// let admin, name;

// name = "Іван";
// admin = name;

// alert(admin);

// Завдання 2 - Придумайте правильні імена //

// Створіть змінну із назвою нашої планети. Як би ви назвали таку змінну?
// Створіть змінну для зберігання імені поточного відвідувача сайту. Як би ви назвали таку змінну?

// let planetEarth = "Земля"
// let currentUserName = "Джаспер"

// Завдання 3 - Використовувати великі чи маленькі букви для імен констант? //

// Переглянемо наступний код:

// const birthday = '18.04.1982';
// const age = someCode(birthday);

// В нас є константа birthday для дати, а також константа age.
// Константа age обчислюється від birthday за допомогою someCode(), що означає виклик функції, яку ми ще не розібрали (ми скоро це зробимо!), але деталі тут не мають значення, річ у тім, що age обчислюється якимось чином на основі birthday.

// Чи можна використовувати великі букви для імені birthday? А для age? Чи для обох змінних?

// const BIRTHDAY = '18.04.1982'; // використовувати великі букви?
// const AGE = someCode(BIRTHDAY); // а тут?

// Ні, не можна (моя думка)

// Зазвичай, ми використовуємо великі букви для констант, які “жорстко закодовані” (hardcoded). Інакше кажучи, коли значення константи відоме до початку виконання скрипту і записується безпосередньо в код.
// В нашому випадку, birthday саме така змінна. Тому для неї ми можемо використати великі букви.
// На відмінну від попередньої, константа age обчислюється під час виконання скрипту. Сьогодні в нас один вік, а через рік вже зовсім інший. Змінна є константою, тому що не змінюється під час виконання коду. Але вона “трохи менша” константа, ніж birthday: вона обчислюється, тому ми повинні зберегти її в нижньому регістрі.

// ---------------- //
// ---------------- //
// ---------------- //

// -- Типи даних -- //

// Завдання - Лапки у рядках //

// Який буде результат виконання скрипту?

// let name = "Ілля";

// alert(`привіт ${1}`); // 1
// alert(`привіт ${"name"}`); // name
// alert(`привіт ${name}`); // Ілля

// ---------------- //
// ---------------- //
// ---------------- //

// -- Базові оператори, математика -- //

// Завдання 1 - Постфіксна та префіксна форми //

// Які кінцеві значення всіх змінних a, b, c та d після виконання коду нижче?

// let a = 1, b = 1;

// let c = ++a; // 2
// let d = b++; // 1

// Завдання 2 - Результат присвоєння //

// Які значення мають a та x після виконання коду нижче?

// let a = 2;

// let x = 1 + (a *= 2); // a=4, x=5

// Завдання 3 - Перетворення типу //

// Які результати цих виразів?

// "" + 1 + 0; // 10 // (1)
// "" - 1 + 0; // -10 => correct: -1 // (2)
// true + false; // 1
// 6 / "3"; // 2
// "2" * "3"; // 6
// 4 + 5 + "px"; // 9px
// "$" + 4 + 5; // $45
// "4" - 2; // 4-2 => correct: 2
// "4px" - 2; // 4px-2 => correct: NaN
// "  -9  " + 5; // '  -9  5' // (3)
// "  -9  " - 5; // '  -9  -5' => correct: -14 // (4)
// null + 1; // null => correct: 1 // (5)
// undefined + 1; // undefined => correct: NaN // (6)
// " \t \n" - 2; // ' \t \n-2' => correct: -2 // (7)

// Пояснення:
// (1) Додавання пустого рядка "" + 1 перетворює число 1 на рядок: "" + 1 = "1"; далі ми маємо "1" + 0, де застосовується те ж саме правило.
// (2) Віднімання - (як і більшість математичних операцій) працює тільки з числами, воно перетворює порожній рядок "" на 0.
// (3) Додавання з рядком додає число 5 до рядка.
// (4) Віднімання завжди перетворює на числа, тому рядок " -9 " перетвориться на число -9 (ігноруючи пробіли навколо нього).
// (5) null стає 0 після числового перетворення.
// (6) undefined стає NaN після числового перетворення.
// (7) Символи пробілів по краях рядка ігноруються під час перетворення в число. Тому рядок, який містить лише символи \t, \n або «звичайні» пробіли, прирівнюється до пустого рядка і стає 0 після числового перетворення.

// Завдання 4 - Виправте додавання //

// Нижче наведено код, що просить користувача ввести два числа і відображає їхню суму. Він працює неправильно. Код у прикладі виводить 12 (для початкових значень у полях вводу).
// У чому помилка? Виправте її. Результат має бути 3.

// let a = prompt("Перше число?", 1);
// let b = prompt("Друге число?", 2);

// alert(+a + +b); // треба було додати + перед кожним числом; або + перед кожним prompt

// ---------------- //
// ---------------- //
// ---------------- //

// -- Оператори порівняння -- //

// Завдання - Оператори порівняння //

// Який буде результат цих виразів?

// 5 > 4; // true // (1)
// "ананас" > "яблуко"; // false // (2)
// "2" > "12"; // false => correct: true // (3)
// undefined == null; // true // (4)
// undefined === null; // false // (5)
// null == "\n0\n"; // true => correct: false // (6)
// null === +"\n0\n"; // false // (7)

// Пояснення:
// (1) Очевидно, 5 більше за 4. true.
// (2) Посимвольне порівняння, тому false. "а" менше за "я".
// (3) Знову посимвольне порівняння. Перший символ рядка "2" більший за перший символ другого рядка — "1".
// (4) Спеціальний випадок. Значення null і undefined рівні лише один одному під час нестрогого порівняння.
// (5) Строге порівняння різних типів, тому false.
// (6) Аналогічно, як в кроці (4), null дорівнює лише undefined.
// (7) Строге порівняння різних типів.

// ---------------- //
// ---------------- //
// ---------------- //

// -- Умовні розгалуження: if, '?' -- //

// Завдання 1 - if (рядок з нулем) //

// Чи буде показано alert?

// if ("0") {
//   alert("Привіт");
// }

// Пояснення:
// Так, буде. Будь-який рядок, окрім порожнього (і "0" не є порожнім), перетворюються на true у логічному контексті.

// Завдання 2 - Назва JavaScript //

// Використовуючи конструкцію if..else, напишіть код, що запитує: ‘Яка “офіційна” назва JavaScript?’. Якщо відвідувач вводить “ECMAScript”, виведіть “Правильно!”, в іншому випадку — виведіть: “Ви не знаєте? ECMAScript!”

// let companyName = prompt("Яка “офіційна” назва JavaScript?", "");

// if (companyName == "ECMAScript") {
//   alert("Правильно!");
// } else {
//   alert("Ви не знаєте? ECMAScript!");
// }

// Завдання 3 - Покажіть знак //

// Використовуючи if..else, напишіть код, що отримує число за допомогою prompt і потім виводить повідомлення alert:

// 1, якщо значення більше нуля,
// -1, якщо менше нуля,
// 0, якщо дорівнює нулю.
// У цьому завданні ми припускаємо, що введене значення завжди є числом.

// let number = prompt("Введіть число", "");

// if (number > 0) {
//   alert(1);
// } else if (number < 0) {
//   alert(-1);
// } else {
//   alert(0);
// }

// Завдання 4 - Перепишіть 'if' на '?' //

// Перепишіть конструкцію if, використовуючи умовний оператор '?':

// let result;

// if (a + b < 4) {
//   result = 'Нижче';
// } else {
//   result = 'Вище';
// }

// let result = a + b < 4 ? "Нижче" : "Вище";

// Завдання 5 - Перепишіть 'if..else' на '?' //

// Перепишіть if..else, використовуючи декілька тернарних операторів '?'.
// Для зручності читання рекомендується розділити код на кілька рядків.

// let message;

// if (login == 'Працівник') {
//   message = 'Привіт';
// } else if (login == 'Директор') {
//   message = 'Вітаю';
// } else if (login == '') {
//   message = 'Немає логіну';
// } else {
//   message = '';
// }

// let login = prompt("Ви хто?", '')

// let message = (login == "Працівник") ? 'Привіт' :
//     (login == 'Директор') ? 'Вітаю' :
//     (login == '') ? 'Немає логіну' :
//     '';
