// --- ПРАКТИКА --- //

// -- Змінні -- //

// ---------------- //

// Завдання 1 - Робота зі змінними //

// Оголосіть дві змінні: admin та name.
// Присвойте значення "Іван" змінній name.
// Скопіюйте значення зі змінної name в admin.
// Виведіть значення змінної admin, використовуючи функцію alert (яка повинна показати “Іван”).

// let admin, name;

// name = "Іван";
// admin = name;

// alert(admin);

// ---------------- //

// Завдання 2 - Придумайте правильні імена //

// Створіть змінну із назвою нашої планети. Як би ви назвали таку змінну?
// Створіть змінну для зберігання імені поточного відвідувача сайту. Як би ви назвали таку змінну?

// let planetEarth = "Земля"
// let currentUserName = "Джаспер"

// ---------------- //

// Завдання 3 - Використовувати великі чи маленькі букви для імен констант? //

// Переглянемо наступний код:

// const birthday = '18.04.1982';
// const age = someCode(birthday);

// В нас є константа birthday для дати, а також константа age.
// Константа age обчислюється від birthday за допомогою someCode(), що означає виклик функції, яку ми ще не розібрали (ми скоро це зробимо!), але деталі тут не мають значення, річ у тім, що age обчислюється якимось чином на основі birthday.

// Чи можна використовувати великі букви для імені birthday? А для age? Чи для обох змінних?

// const BIRTHDAY = '18.04.1982'; // використовувати великі букви?
// const AGE = someCode(BIRTHDAY); // а тут?

// Ні, не можна (моя думка)

// Зазвичай, ми використовуємо великі букви для констант, які “жорстко закодовані” (hardcoded). Інакше кажучи, коли значення константи відоме до початку виконання скрипту і записується безпосередньо в код.
// В нашому випадку, birthday саме така змінна. Тому для неї ми можемо використати великі букви.
// На відмінну від попередньої, константа age обчислюється під час виконання скрипту. Сьогодні в нас один вік, а через рік вже зовсім інший. Змінна є константою, тому що не змінюється під час виконання коду. Але вона “трохи менша” константа, ніж birthday: вона обчислюється, тому ми повинні зберегти її в нижньому регістрі.

// ---------------- //
// ---------------- //
// ---------------- //

// -- Типи даних -- //

// ---------------- //

// Завдання - Лапки у рядках //

// Який буде результат виконання скрипту?

// let name = "Ілля";

// alert(`привіт ${1}`); // 1
// alert(`привіт ${"name"}`); // name
// alert(`привіт ${name}`); // Ілля

// ---------------- //
// ---------------- //
// ---------------- //

// -- Базові оператори, математика -- //

// ---------------- //

// Завдання 1 - Постфіксна та префіксна форми //

// Які кінцеві значення всіх змінних a, b, c та d після виконання коду нижче?

// let a = 1, b = 1;

// let c = ++a; // 2
// let d = b++; // 1

// ---------------- //

// Завдання 2 - Результат присвоєння //

// Які значення мають a та x після виконання коду нижче?

// let a = 2;

// let x = 1 + (a *= 2); // a=4, x=5

// ---------------- //

// Завдання 3 - Перетворення типу //

// Які результати цих виразів?

// "" + 1 + 0; // 10 // (1)
// "" - 1 + 0; // -10 => correct: -1 // (2)
// true + false; // 1
// 6 / "3"; // 2
// "2" * "3"; // 6
// 4 + 5 + "px"; // 9px
// "$" + 4 + 5; // $45
// "4" - 2; // 4-2 => correct: 2
// "4px" - 2; // 4px-2 => correct: NaN
// "  -9  " + 5; // '  -9  5' // (3)
// "  -9  " - 5; // '  -9  -5' => correct: -14 // (4)
// null + 1; // null => correct: 1 // (5)
// undefined + 1; // undefined => correct: NaN // (6)
// " \t \n" - 2; // ' \t \n-2' => correct: -2 // (7)

// Пояснення:
// (1) Додавання пустого рядка "" + 1 перетворює число 1 на рядок: "" + 1 = "1"; далі ми маємо "1" + 0, де застосовується те ж саме правило.
// (2) Віднімання - (як і більшість математичних операцій) працює тільки з числами, воно перетворює порожній рядок "" на 0.
// (3) Додавання з рядком додає число 5 до рядка.
// (4) Віднімання завжди перетворює на числа, тому рядок " -9 " перетвориться на число -9 (ігноруючи пробіли навколо нього).
// (5) null стає 0 після числового перетворення.
// (6) undefined стає NaN після числового перетворення.
// (7) Символи пробілів по краях рядка ігноруються під час перетворення в число. Тому рядок, який містить лише символи \t, \n або «звичайні» пробіли, прирівнюється до пустого рядка і стає 0 після числового перетворення.

// ---------------- //

// Завдання 4 - Виправте додавання //

// Нижче наведено код, що просить користувача ввести два числа і відображає їхню суму. Він працює неправильно. Код у прикладі виводить 12 (для початкових значень у полях вводу).
// У чому помилка? Виправте її. Результат має бути 3.

// let a = prompt("Перше число?", 1);
// let b = prompt("Друге число?", 2);

// alert(+a + +b); // треба було додати + перед кожним числом; або + перед кожним prompt

// ---------------- //
// ---------------- //
// ---------------- //

// -- Оператори порівняння -- //

// ---------------- //

// Завдання - Оператори порівняння //

// Який буде результат цих виразів?

// 5 > 4; // true // (1)
// "ананас" > "яблуко"; // false // (2)
// "2" > "12"; // false => correct: true // (3)
// undefined == null; // true // (4)
// undefined === null; // false // (5)
// null == "\n0\n"; // true => correct: false // (6)
// null === +"\n0\n"; // false // (7)

// Пояснення:
// (1) Очевидно, 5 більше за 4. true.
// (2) Посимвольне порівняння, тому false. "а" менше за "я".
// (3) Знову посимвольне порівняння. Перший символ рядка "2" більший за перший символ другого рядка — "1".
// (4) Спеціальний випадок. Значення null і undefined рівні лише один одному під час нестрогого порівняння.
// (5) Строге порівняння різних типів, тому false.
// (6) Аналогічно, як в кроці (4), null дорівнює лише undefined.
// (7) Строге порівняння різних типів.

// ---------------- //
// ---------------- //
// ---------------- //

// -- Умовні розгалуження: if, '?' -- //

// ---------------- //

// Завдання 1 - if (рядок з нулем) //

// Чи буде показано alert?

// if ("0") {
//   alert("Привіт");
// }

// Пояснення:
// Так, буде. Будь-який рядок, окрім порожнього (і "0" не є порожнім), перетворюються на true у логічному контексті.

// ---------------- //

// Завдання 2 - Назва JavaScript //

// Використовуючи конструкцію if..else, напишіть код, що запитує: ‘Яка “офіційна” назва JavaScript?’. Якщо відвідувач вводить “ECMAScript”, виведіть “Правильно!”, в іншому випадку — виведіть: “Ви не знаєте? ECMAScript!”

// let companyName = prompt("Яка “офіційна” назва JavaScript?", "");

// if (companyName == "ECMAScript") {
//   alert("Правильно!");
// } else {
//   alert("Ви не знаєте? ECMAScript!");
// }

// ---------------- //

// Завдання 3 - Покажіть знак //

// Використовуючи if..else, напишіть код, що отримує число за допомогою prompt і потім виводить повідомлення alert:

// 1, якщо значення більше нуля,
// -1, якщо менше нуля,
// 0, якщо дорівнює нулю.
// У цьому завданні ми припускаємо, що введене значення завжди є числом.

// let number = prompt("Введіть число", "");

// if (number > 0) {
//   alert(1);
// } else if (number < 0) {
//   alert(-1);
// } else {
//   alert(0);
// }

// ---------------- //

// Завдання 4 - Перепишіть 'if' на '?' //

// Перепишіть конструкцію if, використовуючи умовний оператор '?':

// let result;

// if (a + b < 4) {
//   result = 'Нижче';
// } else {
//   result = 'Вище';
// }

// let result = a + b < 4 ? "Нижче" : "Вище";

// ---------------- //

// Завдання 5 - Перепишіть 'if..else' на '?' //

// Перепишіть if..else, використовуючи декілька тернарних операторів '?'.
// Для зручності читання рекомендується розділити код на кілька рядків.

// let message;

// if (login == 'Працівник') {
//   message = 'Привіт';
// } else if (login == 'Директор') {
//   message = 'Вітаю';
// } else if (login == '') {
//   message = 'Немає логіну';
// } else {
//   message = '';
// }

// let login = prompt("Ви хто?", '')

// let message = (login == "Працівник") ? 'Привіт' :
//     (login == 'Директор') ? 'Вітаю' :
//     (login == '') ? 'Немає логіну' :
//     '';

// ---------------- //
// ---------------- //
// ---------------- //

// -- Логічні оператори -- //

// ---------------- //

// Завдання 1 - Який результат АБО? //

// Що виведе код нижче?

// alert(null || 2 || undefined); // 2

// ---------------- //

// Завдання 2 - Який результат alerts, об'єднаних АБО? //

// Що виведе код нижче?

// alert(alert(1) || 2 || alert(3)); // Відповідь: спочатку 1, потім 2.

// Пояснення:
// Виклик alert не повертає значення. Або, іншими словами, повертає undefined.
// Перший АБО || обчислює свій лівий операнд alert(1). Це показує перше повідомлення з 1.
// alert повертає undefined, тому АБО переходить до другого операнда, шукаючи правдиве значення.
// Другий операнд 2 є правдивим, тому виконання зупинено, повернуто 2 і потім показано зовнішнім alert.
// 3 не буде виведене, тому що обчислення не досягає alert(3).

// ---------------- //

// Завдання 3 - Який результат І? //

// Що виведе код нижче?

// alert(1 && null && 2); // null

// ---------------- //

// Завдання 4 - Який результат alerts, об'єднаних за допомогою І? //

// Що виведе код нижче?

// alert(alert(1) && alert(2)); // Відповідь: 1, а потім undefined.

// Пояснення:
// Виклик alert повертає undefined (він просто показує повідомлення, тому не повертається значення, яке б мало сенс).
// Через це && обчислює лівий операнд (виводить 1) і негайно зупиняється, оскільки undefined є хибним значенням. А && шукає хибне значення і повертає його, як це і зроблено.

// ---------------- //

// Завдання 5 - Результат АБО І АБО //

// Який буде результат?

// alert(null || (2 && 3) || 4); // Відповідь: 3.

// Пояснення:
// Пріоритет І && вище за ||, тому він виконується першим.
// Результат 2 && 3 = 3, тому вираз стає:
// null || 3 || 4
// Тепер результат — перше правдиве значення: 3.

// ---------------- //

// Завдання 6 - Перевірте діапазон //

// Напишіть умову if, щоб перевірити, чи age знаходиться між 14 та 90 включно.
// “Включно” означає, що age може досягати країв 14 або 90.

// let age;
// if ((age >= 14) && (age <= 90))

// ---------------- //

// Завдання 7 - Перевірте значення поза діапазоном //

// Напишіть умову if, щоб перевірити, чи значення age НЕ знаходиться між 14 та 90 включно.
// Створіть два варіанти: перший з оператором НЕ !, другий — без нього.

// if (!(age >= 14 && age <= 90));
//- Правильна відповідь бере весь проміжок разом у дужки (age >= 14 && age <= 90) (це означає "вік від 14 до 90"). А потім ставить один знак ! на самому початку, що буквально означає: "перевір, чи вік знаходиться в проміжку, і переверни результат навпаки".

// if (age < 14 || age > 90);
//- Щоб не зачепити число 14 (яке є дозволеним), нам потрібно шукати тих, хто суворо менший: age < 14 (це 13, 12, 11...). Те саме з верхньою межею: суворо більший за 90: age > 90 (це 91, 92...).

// ---------------- //

// Завдання 8 - Питання про "if" //

// Які з цих alert буде виконано?
// Якими будуть результати виразів у if(...)?

// if (-1 || 0) alert("перший"); // -1
// if (-1 && 0) alert("другий"); // 0
// if (null || (-1 && 1)) alert("третій"); // -1 (неправильно)

// Пояснення:
// Відповідь: перший і третій виконаються.
// Деталі:

// Виконається.
// Результат -1 || 0 = -1, правдивий
// if (-1 || 0) alert( 'перший' );

// Не виконається
// -1 && 0 = 0, хибний
// if (-1 && 0) alert( 'другий' );
//- У JavaScript число 0 — це завжди ХИБА (false). Всі інші числа (навіть від'ємні, як -1) — це ПРАВДА (true). Оскільки вийшло if (0), комп'ютер бачить це як if (false). А якщо в умові if стоїть хиба, то код після нього ( alert( 'другий' )) ніколи не запуститься.

// Виконається
// Оператор && має більший пріоритет, ніж ||
// тому -1 && 1 виконається першим, даючи нам послідовність:
// null || -1 && 1  ->  null || 1  ->  1
// if (null || -1 && 1) alert( 'третій' );
//- Чи є -1 хибним? Ні, це число, воно правдиве (true). Чи є 1 хибним? Ні, воно теж правдиве (true). Оскільки хибного значення немає взагалі (обидва числа правдиві), оператор && за своїм правилом просто доходить до самого кінця і повертає останнє значення, тобто 1.

// - У JavaScript хибними числами є ТІЛЬКИ 0 та NaN (не число). Будь-яке інше число (1, 5, -100, -1) — це завжди чиста правда - //

// ---------------- //

// Завдання 9 - Перевірте логін //

// Напишіть код, який запитує логін за допомогою prompt.

// Якщо відвідувач вводить "Admin", тоді запропонуйте за допомогою prompt ввести пароль. Якщо введено порожній рядок або натиснуто Esc – показати “Скасовано”. Якщо введено інший рядок – тоді покажіть “Я вас не знаю”.

// Пароль перевіряється наступним чином:
// Якщо він дорівнює “Господар”, тоді покажіть “Ласкаво просимо!”,
// Інший рядок – покажіть “Неправильний пароль”,
// Для порожнього рядка, або якщо введення було скасовано, покажіть “Скасовано”.

// Будь ласка, використовуйте вкладені if блоки. Потурбуйтесь про загальну читабельність коду.
// Підказка: передача порожнього вводу до запиту повертає порожній рядок ''. Натискання ESC протягом запиту повертає null.

// let userType = prompt("Who's there?", "");
// let pass =

// if (userType === "Admin") {
//   return prompt("Password?");
//   if (pass === "TheMaster") {
//     return alert("Welcome");
//   } else if (" ") {
//     return alert("Wrong password");
//   }
// } else if (" ") {
//   return alert("I don't know you");
// }
// // - НЕПРАВИЛЬНО

// Відповідь і пояснення:

// let userName = prompt("Хто там?", "");

// if (userName === "Admin") {
//   let pass = prompt("Пароль?", "");

//   if (pass === "Господар") {
//     alert("Ласкаво просимо!");
//   } else if (pass === "" || pass === null) {
//     alert("Скасовано");
//   } else {
//     alert("Неправильний пароль");
//   }
// } else if (userName === "" || userName === null) {
//   alert("Скасовано");
// } else {
//   alert("Я вас не знаю");
// }

// Зверніть увагу на вертикальні відступи у блоках if. Вони технічно не потрібні, але роблять код читабельним.

// ---------------- //
// ---------------- //
// ---------------- //

// -- Цикли: while і for -- //

// ---------------- //

// Завдання 1 - Останнє значення циклу //

// Яке останнє значення буде виведено на екран? Чому?

// let i = 3;

// while (i) {
//   alert(i--);
// }

// Відповідь: 1. Кожна ітерація циклу зменшує i на 1. Перевірка while (i) зупинить цикл, коли i = 0. У JavaScript число 0 — це завжди хиба (false), а будь-яке інше число (наприклад, 3, 2, 1, -5) — це правда (true).

// ---------------- //

// Завдання 2 - Яке значення виведе цикл "while"? //

// Запишіть для кожного циклу значення, які він виведе. Потім порівняйте з відповіддю.
// Чи виводять обидва цикли однакові значення?

// Префіксна форма ++i:

// let i = 0;
// while (++i < 5) alert(i); // 0 (неправильно)

// Перший цикл виведе числа від 1 до 4

// Перше значення i = 1, тому що операція ++i спочатку збільшує i, і після цього повертає нове значення. Відповідно, перше порівняння буде 1 < 5 і alert виведе 1.
// Далі йдуть 2, 3, 4… – значення показуються одне за одним. Порівняння завжди відбувається зі збільшеним значенням, тому що ++ стоїть перед змінною.
// Наприкінці, коли i = 4 збільшується до 5, умова while(5 < 5) не справджується, і в результаті цикл зупиняється. Отже, 5 не покажеться.

// Постфіксна форма i++

// let i = 0;
// while (i++ < 5) alert(i); // 1, 2, 3, 4 (теж не зовсім правильно)

// Другий цикл виведе числа від 1 до 5

// Перше значення знову i = 1. Постфіксна форма i++ збільшує i до 1 і повертає старе значення, тому порівняння i++ < 5 буде виконуватися з i = 0 (на противагу ++i < 5).
// Далі йде виклик alert. Однак, це вже інший вираз, який виконується після збільшення i та порівняння. Тому він отримає поточне значення i = 1.
// Далі слідують 2, 3, 4….
// Зупинимося на i = 4. Префіксна форма ++i збільшила б i до 5 і використала це значення в порівнянні. Проте ми маємо постфіксну форму i++. Отже, вона збільшить i до 5, але поверне старе значення. Таким чином порівняння буде while(4 < 5) – що вірно, а тому відбудеться виклик alert.
// Значення i = 5 буде останнім, тому що наступний крок вже буде while(5 < 5) – що не вірно.

// ---------------- //

// Завдання 3 - Яке значення виведе цикл "for"? //

// Для кожного циклу запишіть, які значення він виведе. Потім порівняйте з відповіддю.
// Обидва цикли виведуть одинакові числа чи ні?

// Постфіксна форма:

// for (let i = 0; i < 5; i++) alert(i); // 1-4 (майже)

// Префіксна форма:

// for (let i = 0; i < 5; ++i) alert(i); // 1-4 (майже)

// Відповідь: обидва цикли виведуть від 0 до 4.

// Такий результат обумовлений алгоритмом роботи for:
// Перед виконанням циклу, присвоїти i = 0 (початок).
// Перевірити умову i < 5.
// Якщо true – виконати тіло циклу: викликати alert(i), а потім i++.
// Збільшення i++ виконується окремо від перевірки умови (2 крок). Це інша інструкція.
// Значення i після збільшення тут не використовується, тому немає різниці між i++ та ++i.

// ---------------- //

// Завданя 4 - Виведіть парні числа //

// Виведіть парні числа від 2 до 10, використовуючи цикл for.

// for (let s = 2; s <= 10; s += 2) alert(s);

// Або відповідь така:

// for (let i = 2; i <= 10; i++) {
//   if (i % 2 == 0) {
//     alert( i );
//   }
// }

// Для того, щоб перевіряти числа на парність, ми використовуємо оператор остачі від ділення %.

// ---------------- //

// Завдання 5 - Замініть цикл "for" на "while" //

// Замініть цикл for на while так, щоб поведінка не змінилася (щоб вивід залишився той самий).

// for (let i = 0; i < 3; i++) {
//   alert(`число ${i}!`);
// }

// let i = 0;
// while (i < 3) {
//   alert(`число ${i}!`);
//   i++;
// }

//- У while збільшуємо i++ наприкінці кола, щоб спочатку вивести поточне число, як у циклі for

// ---------------- //

// Завдання 6 - Повторяти цикл, доки ввід невірний //

// Напишіть цикл, який пропонує prompt ввести число більше за 100. Якщо відвідувач введе інше число – попросити ввести ще раз, і так далі.
// Цикл повинен запитувати число доти, доки відвідувач не введе число, більше за 100, або не скасує ввід/введе порожній рядок.
// Ми припускаємо, що відвідувач вводитиме лише числа. В цьому завданні не обов’язково реалізовувати оброблення нечислового введення.

// let number;
// do {
//   num = +prompt("Введіть число більше ніж 100", 0);
// } while (num <= 100 && num); //- Цикл крутиться, поки число менше 100 ТА поки користувач не скасував ввід (натиснув Cancel)

//- Пояснення:
// Цикл do..while повторятиметься доки справджуються дві перевірки:
// 1. Перевірка num <= 100 – тобто, що введе число досі менше за 100.
// 2. Перевірка && num рахуватиметься false, коли num матиме значення null або порожній рядок ''. В цьому випадку цикл while теж потрібно буде зупинити.
// Друга перевірка додається через те, що у випадку, коли num буде null, тоді перевірка num <= 100 верне true. Отже, без другої перевірки цикл не зупиниться, якщо користувач натисне Скасувати. Необхідні обидві перевірки.

// ---------------- //

// Завдання 7 - Вивести прості числа //

// Просте число – це натуральне число, яке має два дільники (1 і саме число).
// Інакше кажучи, n > 1 – просте, якщо воно більше за 1 і ділиться без остачі на 1 та n.

// Наприклад, число 5 – просте, тому що воно не ділиться без остачі на 2, 3 і 4. Воно ділиться без остачі лише на 1 і на 5.

// Напишіть код, який виводить всі прості числа в діапазоні від 2 до n.
// Для n = 10 результат повинен бути 2,3,5,7.
// P.S. Код також повинен легко модифікуватися для будь-якого числа n.

// let n = 10;

// nextPrime: for (let s = 2; s <= n; s++) {
//   for (let k = 2; k < s; k++) {
//     if (s % k == 0) continue nextPrime;
//   }
//   alert(s);
// }

// ---------------- //
// ---------------- //
// ---------------- //

// -- Конструкція "switch" -- //

// ---------------- //

// Завдання 1 - Перепишіть конструкцію "switch" в аналогічну з використанням "if" //

// Напишіть код з використанням if..else, що відповідає наступній конструкції switch:

// switch (browser) {
//   case "Edge":
//     alert("You've got the Edge!");
//     break;

//   case "Chrome":
//   case "Firefox":
//   case "Safari":
//   case "Opera":
//     alert("Ми підтримуємо і ці браузери");
//     break;

//   default:
//     alert("Маємо надію, що ця сторінка виглядає добре!");
// }

// if (browser === "Edge") {
//   alert("You've got the Edge!");
// } else if (
//   browser === "Chrome" ||
//   browser === "Firefox" ||
//   browser === "Safari" ||
//   browser === "Opera"
// ) {
//   alert("Ми підтримуємо і ці браузери");
// } else {
//   alert("Маємо надію, що ця сторінка виглядає добре!");
// }

// ---------------- //

// Завдання 2 - Перепишіть умови "if" в конструкцію "switch" //

// Перепишіть код нижче використовуючи одну конструкцію switch:

// let a = +prompt("a?", "");

// if (a == 0) {
//   alert(0);
// }
// if (a == 1) {
//   alert(1);
// }

// if (a == 2 || a == 3) {
//   alert("2,3");
// }

// switch (a) {
//   case 0:
//     alert(0);
//     break;

//   case 1:
//     alert(1);
//     break;

//   case 2:
//   case 3:
//     alert("2,3");
//     break;
// }

// Пояснення:
// Перші дві перевірки перетворюємо в два case. Третю перевірку розділяємо на два case
// Зверніть увагу: break знизу не обов’язковий. Але ми його вказуємо, щоб зробити наш код надійнішим за умови майбутніх змін.
// У майбутньому є можливість що ми додамо ще один блок case, наприклад case 4. В разі якщо ми забудемо додати break перед ним наприкінці коду з case 3, – ми отримаємо помилку у логіці роботи нашого коду. Таким чином це своєрідне самострахування.

// ---------------- //
// ---------------- //
// ---------------- //

// -- Функції -- //

// ---------------- //

// Завдання 1 - Чи потрібен "else"? //

// Наступна функція повертає true, якщо параметр age більший за 18.
// Інакше вона запитує підтвердження через confirm і повертає його результат:

// function checkAge(age) {
//   if (age > 18) {
//     return true;
//   } else {
//     // ...
//     return confirm('Батьки дозволили?');
//   }
// }

// Чи буде функція працювати по-іншому, якщо забрати else?

// function checkAge(age) {
//   if (age > 18) {
//     return true;
//   }
//   // ...
//   return confirm('Батьки дозволили?');
// }

// Чи є різниця в поведінці цих двох варіантів?

// Немає різниці!
// В обох випадках return confirm('Батьки дозволили?') виконується саме тоді, коли умова if є помилковою.

// ---------------- //

// Завдання 2 - Перепишіть функцію, використовуючи '?' або '||' //

// Наступна функція повертає true, якщо параметр age більший за 18.
// Інакше вона запитує підтвердження через confirm і повертає його результат:

// function checkAge(age) {
//   if (age > 18) {
//     return true;
//   } else {
//     return confirm("Батьки дозволили?");
//   }
// }

// Перепишіть функцію, щоб вона робила теж саме, але без if і в один рядок.
// Зробіть два варіанти функції checkAge:
// 1. Використовуючи оператор ?;

// function checkAge(age) {
//   return age > 18 ? true : confirm("Батьки дозволили?");
// }

// 2. Використовуючи оператор АБО ||

// function checkAge(age) {
//   return age > 18 || confirm("Батьки дозволили?");
// }

// function getName(name) {
//   return name || "Гість";
// }

// ---------------- //

// Завдання 3 - Функція min(a, b) //

// Напишіть функцію min(a, b), яка повертає менше з двох чисел a та b.
// Наприклад:

// min(2, 5) == 2
// min(3, -1) == -1
// min(1, 1) == 1

// function min(a, b) {
//   if (a < b) {
//     return a;
//   } else {
//     return b;
//   }
// }

// function min(a, b) {
//   return a < b ? a : b;
// }

// ---------------- //

// Завдання 4 - Функція pow(x, n) //

// Напишіть функцію pow(x, n), яка повертає число x, піднесене до степеня n. Інакше кажучи, множить число x саме на себе n разів і повертає результат.

// pow(3, 2) = 3 * 3 = 9
// pow(3, 3) = 3 * 3 * 3 = 27
// pow(1, 100) = 1 * 1 * ...* 1 = 1

// Створіть сторінку, яка запитує x та n, а потім показує результат pow(x, n).

// P.S. В цій задачі функція повинна підтримувати лише натуральні значення n, тобто цілі числа, починаючи з 1.

// function pow(x, n) {
//   let result = 1;
//   for (let i = 0; i < n; i++) {
//     result *= x;
//   }
//   return result;
// }

// let x = +prompt("Напишіть число", '');
// let n = +prompt("Напишіть степінь числа", '');

// if (n < 1 || n % 1 !== 0) {
//   alert("Степінь має бути цілим числом більшим за 0");
// } else {
//   let finalResult = pow(x, n);
//   alert(finalResult);
// }

// ---------------- //
// ---------------- //
// ---------------- //

// -- Стрілкові функції, основи -- //

// ---------------- //

// Завдання - Перепишіть з використанням стрілкових функцій //

// Замініть Функціональні Вирази на стрілкові функції у коді нижче:

// function ask(question, yes, no) {
//   if (confirm(question)) yes();
//   else no();
// }

// ask(
//   "Ви згодні?",
//   function () {
//     alert("Ви погодились.");
//   },
//   function () {
//     alert("Ви скасували виконання.");
//   },
// );

//

// ask(
//   "Ви згодні?",
//   () => alert("Ви погодились."),
//   () => alert("Ви скасували виконання."),
// );

// ---------------- //
// ---------------- //
// ---------------- //

// -- Масиви -- //

// ---------------- //

// Завдання 1 - Чи скопійовано масив? //

// Що продемонструє наступний код?

// let fruits = ["Apples", "Pear", "Orange"];

// // додаємо нове значення в "копію"
// let shoppingCart = fruits;
// shoppingCart.push("Banana");

// // Що в fruits?
// alert(fruits.length); // 4 - Це відбувається тому, що масиви — це об’єкти. Отже, shoppingCart та fruits посилаються на один і той самий об’єкт.

// ---------------- //

// Завдання 2 - Операції з масивами //

// Давайте спробуємо 5 операцій з масивом.

// Створіть масив styles з елементами “Jazz” та “Blues”.
// Додайте “Rock-n-Roll” в кінець масиву.
// Замініть значення в середині масиву на “Classics”. Ваш код для пошуку медіанного елемента має працювати для будь-яких масивів непарної довжини.
// Видаліть перший елемент масиву та покажіть його.
// Вставте Rap та Reggae на початок масиву.

// Вигляд масиву по ходу виконання операцій:
// Jazz, Blues
// Jazz, Blues, Rock-n-Roll
// Jazz, Classics, Rock-n-Roll
// Classics, Rock-n-Roll
// Rap, Reggae, Classics, Rock-n-Roll

// let musicStyles = ["Jazz", "Blues"];
// musicStyles.push("Rock-n-Roll");
// musicStyles[Math.floor((musicStyles.length - 1) / 2)] = "Classics";
// alert(musicStyles.shift());
// musicStyles.unshift("Rap", "Reggae");

// for (let i = 0; i < musicStyles.length; i++) {
//   if (i % 2 !== 0) {
//     i = "Classics";
//   }
// } //- для завдання неправильно але взагалі-то правильно для визначення заміни кожного парного

// ---------------- //

// Завдання 3 - Виклик в контексті масиву //

// Яким буде результат? Чому?

// let arr = ["a", "b"];

// arr.push(function () {
//   alert(this);
// });

// arr[2](); // не вчила ще this

// Відповідь:
// Виклик arr[2]() це – синтаксично старий-добрий obj[method](), в ролі obj ми маємо arr, а в ролі method ми маємо 2.
// Ми маємо виклик функції arr[2] як методу об’єкту. Відповідно, він отримає в якості this об’єкт arr та виведе масив:

// let arr = ["a", "b"];
// arr.push(function() {
//   alert( this );
// })
// arr[2](); // a,b,function(){...}
// Масив має 3 елемента, спочатку їх було 2, плюс функція.

// ---------------- //

// Завдання 4 - Сума введених чисел //

// Напишіть функцію sumInput() яка:
// Просить користувача ввести дані за допомогою prompt та зберігає їх в масив.
// Закінчує робити запити в користувача після того, як введено не числове значення, порожня строка або натиснуто “відмінити”.
// Підраховує та повертає суму елементів масиву.
// P.S. Нуль 0 це – валідне число, будь ласка, не зупиняйте функцію при введені 0.

// function sumInput() {
//   let numbers = [];
//   while (true) {
//     let value = prompt("Введіть число");
//     if (value === null || value === "" || !isFinite(value)) {
//       break;
//     } else {
//       numbers.push(Number(value));
//     }
//   }
//   let sum = 0;
//   for (let number of numbers) {
//     sum += number;
//   }
//   return sum;
// }

// alert(sumInput());
//- Зверніть увагу на одну важливу річ у вирішенні цієї задачі. Ми не конвертуємо value в число одразу після prompt, тому що одразу після операції value = +value ми не зможемо відрізнити порожній рядок (зупинення роботи функції) від нуля (дійсне число). Тому ми робимо це пізніше.
