// --------------------------//
// --------------------------//
// Області видимості
// --------------------------//
// --------------------------//

// const a = 5;

// if (true) {
//   const b = 10;
//   console.log("Block", b);
// }

// console.log("Global", b);

// --------------------------//
// --------------------------//
// Цикли
// --------------------------//
// --------------------------//
//- ітерація це одне виконання циклу

// while

// let a = 0; //- нехай а з кожним заходом на сайт буде збільшуватись на 1 і виводитись в консоль поки не буде 5

//- ОБЕРЕЖНО: без умови виходу з циклу while він буде виконуватись вічно і зависне браузер

// while (a < 5) {
//   a++; //- можна писати а+1 або а++ - це те саме
//   console.log("a", a);
// }

// let a = 0;

// while (a) console.log(a--);
//- якщо одна умова більш правильно писати так скорочено; а записано просто як умова, бо 0 це false, а всі інші числа true; якщо б було 1 то вивело б 1 і зменшило б на 1 і вивело б 0 і зупинилось би

// do while //- по суті це те саме що і while але спочатку виконується тіло циклу а потім перевіряється умова, тому він виконається хоча б один раз

// do {
//   console.log(a);
//   a++;
// } while (a < 5);

//for //- використовується коли відома кількість ітерацій, а while коли невідома; потребує три параметри: ініціалізація, умова, крок - їх писати через крапку з комою; якщо не передати крок то буде вічний цикл

// let a = 0;

// for (; a < 3; ) { //- можна не передавати першу а але обовʼязково лишити крапку з комою
//   a++;
//   console.log(a);
// }

// break && continue

//- break - зупиняє цикл повністю

// let summ = 0;

// while (true) {
//   let value = +prompt("Введіть ч исло"); //- тут стоїть плюсик щоб не було конкатинації строчок
//   if (!value) break;

//   summ += value;
// }

//- continue - це полегшений break, він пропускає ітерацію і переходить до наступної, а break зупиняє цикл повністю

// console.log("Summ", summ);

// for (let i = 0; i < 10; i++) {   //- якщо число парне то пропускаємо ітерацію і переходимо до наступної
//   if (i % 2 === 0) continue;
//   console.log(i);
// }

// --------------------------//
// --------------------------//
// масиви
// --------------------------//
// --------------------------//
//- варіант запису переліку чогось (замість того щоб використовувати обʼєкт, де є і case і шось ще); дужки []; елементи зберігаються в порядку додавання; індекси починаються з 0; довжина масиву - це кількість елементів в ньому; якщо елемент не існує то буде undefined

// let arr = ["Apple", "Orange", "Plum"];

// arr[2] = "Lemon"; //- заміна елемента масиву p Plum на Lemon

// arr[3] = "Cherry";

// console.log(arr); //- виводить весь масив

// console.log(arr[0]); //- виводить елемент масиву з індексом 0

// console.log(arr.length); //- виводить довжину масиву

// arr2 = [1, "hello", { key: "" }]; //- у масиві може бути все що завгодно: цифри, стро чки, обʼєкти, інші масиви

// --------------------------//
// додавання віднімання масивів
// --------------------------//
//- черга (перший/останній) - можна видалати з масиву або додавати в кінець масиву;
//- стек - можна видаляти з масиву або додавати тільки в кінець масиву

//- push додає, pop віднімає - одибва працюють з останнім елементом масиву;
//- shift віднімає, unshift додає - обидва працюють з першим елементом масиву

// arr.push("Tomat");

// console.log(arr);

// arr.pop();

// console.log(arr);

// arr.shift();

// console.log(arr);

// arr.unshift("Tomat");

// console.log(arr);

// --------------------------//
//- переробка масивів - це коли ми перебираємо масив і робимо щось з його елементами, наприклад виводимо їх в консоль
//- перебирати масиви можна трьома способами: for, for of, for in;  for - перебирає індекси елементів масиву, але можна вивести і значення елементів масиву; for of - перебирає значення елементів масиву; for in - перебирає індекси елементів масиву;

// for (let i = 0; i < arr.length; i++) { //- старий спосіб перебору масиву, зараз його майже не використовують
//   console.log(arr[i]);
// }

// for (let item of arr) { //- єдине що, for of не надає доступ до індексу, лише до поточного елементу
//   console.log(item);
// }

// for (let key in arr) {
//   console.log(arr[key]);
// }
//- перебирає індекси елементів масиву, можна вивести і значення елементів масиву, але це не зовсім коректно, бо for in призначений для перебору обʼєктів, а не масивів

// --------------------------//
//- масиви можуть зберігати всередині себе теж масиви, тоді це буде двовимірний масив, де перший індекс - це рядок, а другий індекс - це стовпчик; щоб отримати доступ до елемента двовимірного масиву потрібно вказати два індекси: спочатку рядок, потім стовпчик

// let matrix = [
//   [1, 2, 3],
//   [4, 5, 6],
//   [7, 8, 9],
// ];
// console.log(matrix[1][2]);

//- порівнювати масиви не можна, бо вони зберігаються в памʼяті як обʼєкти, а обʼєкти порівнюються за посиланням, а не за значенням; тому два однакових масиви будуть різними, бо вони зберігаються в різних місцях памʼяті; чкщо все ж порівняння потрібне, то треба перебирати масиви і порівнювати кожен елемент окремо; якщо хоч один елемент не співпадає, то масиви різні

// --------------------------//
// --------------------------//
// методи присвоєння
// --------------------------//
// --------------------------//
//- примітивні та непримітивні

//- примітивні типи даних - це числа, строки, булеві значення, null, undefined, символи; вони копіюються за значенням (by value) вони зберігаються в памʼяті як значення; коли ми присвоюємо примітивну змінну іншій змінній, то копіюється значення, а не посилання на нього; тому якщо ми змінюємо значення однієї змінної, то інша змінна не змінюється

// let a = 5;
// let b = a;

// a = 10;

// console.log(a);
// console.log(b);

//- непримітивні типи даних - це обʼєкти, масиви, функції; вони зберігаються в памʼяті як посилання на обʼєкт; коли ми присвоюємо непримітивну змінну іншій змінній, то копіюється посилання на обʼєкт, а не значення; тому якщо ми змінюємо значення однієї змінної, то інша змінна теж змінюється

// let arr2 = arr;

// arr.push(4);

// console.log(arr2);

// --------------------------//
// --------------------------//
// методи масиву
// --------------------------//
// --------------------------//
//- з масивами через delete не можна, бо delete видаляє елемент масиву, але не змінює його довжину, тому після видалення елемента масиву, він залишиться undefined;
//- для видалення елементів масиву потрібно використовувати методи масиву, такі як splice, slice, concat, indexOf, lastIndexOf, includes, find, filter, map, split, join, reduce

// let arr = ["a", "b", "c", "d", "f"];

// arr.splice(2, 2); //- splice видаляє елементи масиву, перший параметр - це індекс з якого починаємо видаляти, другий параметр - це кількість елементів які потрібно видалити; якщо другий параметр не вказаний, то видаляються всі елементи від індексу до кінця масиву

// console.log(arr);

// console.log(arr.slice(1, 3)); //- slice повертає новий масив, який містить елементи від індексу 1 до індексу 3 (не включаючи його); якщо другий параметр не вказаний, то повертаються всі елементи від індексу до кінця масиву

// let a = [1, 2, 3];

// console.log(arr.concat(a, "test")); //- concat повертає новий масив, який містить елементи масиву arr, а також елементи масиву a та строку "test"; якщо передати кілька параметрів, то вони будуть додані до нового масиву в порядку їх передачі

// console.log(arr.indexOf("c", 1)); //- indexOf повертає індекс першого елемента масиву, який дорівнює переданому значенню; якщо елемент не знайдено, то повертається -1; другий параметр - це індекс з якого починаємо шукати; якщо він не вказаний, то пошук починається з початку масиву

// console.log(arr.lastIndexOf("c")); //- lastIndexOf повертає індекс останнього елемента масиву, який дорівнює переданому значенню; далі все те саме що і indexOf

// console.log(arr.includes("c")); //- includes повертає true, якщо елемент масиву дорівнює переданому значенню; якщо елемент не знайдено, то повертається false

// --------------------------//
// як шукати по масиву
// --------------------------//
//- find - повертає перший елемент масиву, який задовольняє умові, яка передана в колбек функцію; якщо елемент не знайдено, то повертається undefined, якщо знайдено, то на цьому все
//- filter - повертає новий масив, який містить всі елементи масиву, які задовольняють умові, яка передана в колбек функцію; якщо елементів не знайдено, то повертається порожній масив
//- map - викликає функцію для кожного елемента масиву, повертає новий масив, який містить результати виконання колбек функції для кожного елемента масиву; якщо колбек функція не повертає значення, то в новому масиві будуть undefined
//- split - розбиває строку на масив підстрок, які розділені переданим роздільником (напр. ", "); якщо роздільник не вказаний, то повертається масив з одним елементом - всією строкою
//- join - обʼєднує елементи масиву в строку, розділену переданим роздільником; якщо роздільник не вказаний, то елементи масиву обʼєднуються без роздільника
//- reduce - виконує колбек функцію для кожного елемента масиву, зберігаючи результат виконання в акумуляторі; якщо переданий початковий акумулятор, то він буде використаний як перший елемент масиву; якщо початковий акумулятор не переданий, то перший елемент масиву буде використаний як початковий акумулятор
//- reduceRight - те саме що і reduce, але виконує колбек функцію для кожного елемента масиву з кінця до початку

// const fruts = [
//   { id: 0, name: "Apple" },
//   { id: 1, name: "Tomat" },
//   { id: 2, name: "Cherry" },
//   { id: 3, name: "Orange" },
// ];

// console.log(fruts.find((item) => item.id === 1));

// console.log(fruts.filter((item) => item.id < 2));

// let result = fruts.map((item) => item.name.length); //- найчастіше використовується для відмальовки фото, items і тд
// console.log(result);

// let names = "Оля, Юля, Аня, Петя";

// let arr = names.split(", ");

// let newString = arr.join(", ");

// console.log(newString);

// let value = arr.reduce(
//   function (accumulator, item, index, array) {
//     // ...
//   },
//   [initial]
// );

// let arr = [1, 2, 3, 4, 5];

// let red = arr.reduce((summ, item) => summ + item);

// console.log(red);

// let arr = [23, 45, 30];

// let summ = arr.reduce((sum, item) => sum + item) / arr.length;
// console.log(summ);
